/* eslint-disable react/no-unescaped-entities */
import { Articles } from './Articles';
import { HeadlinesSml } from '../../../../../components/HeadlinesSml';
import './styles.scss';

export const MakeBetterNavigation = () => (
  <div className="make-better-navigation">
    <HeadlinesSml text="Основи навігації у Вікіпедії" />
    <div className="em-link">
      <i>Довідка:Навігація</i>
    </div>
    <p>
      Вікіпедійні статті є пов'язаними чи перехресно пов'язаними. Коли ви бачите підсвічений синім
      кольором текст, як оцей, це значить, що це є посилання (лінк) на відповідну статтю на
      сторінках Вікіпедії, що дає поглибленіші відомості в іншому місці. Утримавши мишу на
      посиланні, ви побачите, куди воно вас поведе. Ви всього на крок від докладнішої інформації, на
      яку теж прикріплено чимало посилань.
    </p>
    <p>
      Є також чимало посилань наприкінці більшості статей на друковані джерела, на Вікіпедію (т. зв.
      внутрішні посилання) чи на сестринські проєкти, як в Головній сторінці:
    </p>
    <Articles />
    <div className="article-also">Див. також сторінки Фонду Вікімедіа та Вікімедіа Україна</div>
    <p>, а для інших статей відповідними є вебпосилання (чи т. зв. зовнішні посилання).</p>
    <p>
      Внутрішні посилання Вікіпедії дозволяють посилатися на статті чи розділи статей, зображення,
      портали, категорії чи інші структурні елементи Вікіпедії. Для багатьох посилань у Вікіпедії
      розроблені шаблони, зокрема для уніфікації посилань на сестринські Вікіпроєкти, наприклад
      наведені вище такі посилання, зроблені зображеннями (іконками), задаються <b>одним</b> (!)
      шаблоном.
    </p>
    <p>
      Стаття, зображення і т. п. можуть бути віднесені до однієї чи декількох категорій.
      Категоризація — вид класифікації. Посилання (реферативний матеріал) і категорії, організовані
      в ієрархічну систему знань, дозволяють знаходити і переглядати самі категорії й елементи до
      них віднесені (статті, зображення, звуки, відео і т. п.) зверху вниз (деталізація, докладніше)
      і знизу вверх (узагальнення) або розглядати знання в різних категоріях і поза категоріями. Все
      це дозволяє структуризувати знання і отримувати докладніші відомості.
    </p>
    <p>
      Окремі статті можуть мати посилання на словникові визначення, аудіокниги, цитати чи подібні
      статті іншими мовами. Посилання на статті іншими мовами називається інтервікі.
    </p>
    <p>
      Можна додавати подальші чи виправляти посилання, коли релевантні посилання втратились, і це —
      ще один шлях для долучення до роботи над покращенням Вікіпедії.
    </p>
    <p>Для навігації по Вікіпедії корисним є Шаблон:Навігатор по Вікіпедії.</p>
    <HeadlinesSml text="Використання Вікіпедії як дослідницького інструментарію" />
    <div className="em-link">
      <i>Вікіпедія:Дослідження з Вікіпедією та Вікіпедія:Цитування Вікіпедії</i>
    </div>
    <p>
      Оскільки це вікі, статті ніколи не будуть закінченими. Вони безперестанку редагуватимуться і
      вдосконалюватимуться, і цей результат тяжітиме до стандартів якості, збільшення консенсусу чи
      правдивішого й збалансованішого висвітлення інформації.
    </p>
    <p>
      Користувачі мусять усвідомлювати, що не всі статті є енциклопедичної якості відразу після
      появи. Справді, чимало статей початково виражають певну позицію, а вже протягом тривалого
      процесу обговорень, дебатів та аргументів, вони поступово набувають ознак нейтральної точки
      зору через консенсус. Інші тривалий час можуть бути з незбалансованим поглядом, й це може
      тривати досить довго — навіть й місяці — допоки стаття не стане виправленою.
    </p>
    <p>
      Почасти, це має місце, коли учасники не можуть погодити вміст чи ж підходи, а ці проблеми
      забирають час й інколи вимагають досвідченіших редакторів.
    </p>
    <p>
      Ідеальна стаття Вікіпедії є збалансованою, нейтральною та енциклопедичною, вирізняється
      верифікованими джерелами (див. також Вікіпедія:Авторитетні джерела). Зростаюча кількість
      статей наближається до цих стандартів увесь час, і багато статей їх вже досягли. Найкращі
      статті Вікіпедії називаються вибраними (позначаються маленькою бронзовою зіркою —
      Cscr-featured.svg в правому верхньому кутку статті), кращі статті наступного рівня називаються
      добрими (позначаються блакитним значком плюс — Dobra5.png в правому верхньому кутку статті).
      Однак створення доброї чи вибраної статті це процес, і він може тривати місяці або й роки до
      завершення, поки кожен користувач не зробить відповідного внеску. Деякі статті містять
      твердження чи заклики, які досі ще не цитувались. Інші ж, мають нові додані секції. Деяка
      інформація розглядається як недостатньо підтверджена і згодом вилучається або модифікується.
    </p>
    <p>
      Звертаючи увагу на вищезазначене, важливим є уважне та ретельне використання Вікіпедії як
      джерела досліджень, оскільки окремі статті будуть, за своєю суттю, вирізнятись як стандартами,
      так і зрілістю. Для цього є політики й стандарти та спеціальні (інформаційні) сторінки,
      призначені для того, щоб допомогти користувачам та дослідникам зробити це ефективніше, а
      статтям підсумувати неупередженість досліджень та тверджень, щоб підтвердити надійність та
      поважність (авторитетність, респектабельність) Вікіпедії як джерела.
    </p>
    <div className="em-link">
      <i>Вікіпедія:Як використовувати Вікіпедію</i>
    </div>
    <HeadlinesSml text="Чим Вікіпедія відрізняється від паперової енциклопедії" />
    <div className="em-link">
      <i>Вікіпедія — не папір (http://meta.wikimedia.org/wiki/Wiki_is_not_paper (англ.))</i>
    </div>
    <div className="em-link-also">
      <i>Вікіпедія:Чим не є Вікіпедія#Вікіпедія — не паперова енциклопедія</i>
    </div>
    <HeadlinesSml text="Переваги, недоліки та якість статей Вікіпедії" />
    <p>
      Найбільші переваги (сильні сторони) Вікіпедії, недоліки (слабкі сторони, слабкості) та
      розбіжності виникають унаслідок того, що вона відкрита для кожного, має велику кількість
      дописувачів, та те, що статті пишуться за погодженням, які виникають унаслідок редакційних
      правил-погоджень (guidelines) та політик.
    </p>
    <p>
      Вікіпедія відкрита для широкої кількості дописувачів — тож це мінімізує упередженість, важко
      піддається цензуруванню. З іншого боку відкритість Вікіпедії спричиняє велику відповідальність
      за нову інформацію, зокрема на таку, яка не є широко відомою для загалу дописувачів, а також
      полегшує вандалізм чи додавання неперевіреної інформації, які належить вилучати.
    </p>
    <p>
      Вікіпедія пишеться за погодженням — тож, ймовірно, для більшості статей усі значущі погляди в
      кінці будуть описані правдиво і найбільш нейтральна позиція може бути досягнута навіть на
      найемоційніші теми; досягнення погодження по таких питаннях може зайняти більший час, ніж саме
      компілювання, оформлення статті, й особливо важко може даватись дописувачам із крайніми
      поглядами. (Статтям також притаманна більша змінність, гнучкість, порівняно з іншими
      довідковими джерелами, та врешті-решт, вони знаходять свій «нейтральний підхід», про який усі
      сторони можуть домовитися).
    </p>
    <HeadlinesSml text="Головні переваги" />
    <div className="em-link">
      <i>Вікіпедія:Чому Вікіпедія є такою великою</i>
    </div>
    <p>
      Маючи велику кількість статей та редакторів багатьма мовами, Вікіпедія часто забезпечує доступ
      до даних, які нерідко або недосяжні, або ж недостатньо документовані. Вікіпедія часто пропонує
      прекрасні енциклопедичні статті та дані, що показують найновіші події, що стались (чи
      відбуваються) протягом годин і днів свого розвитку (події у розвитку). Вікіпедія є одним із
      небагатьох осідків, що завше старається керуватись нейтральністю, об'єктивністю,
      енциклопедичним вмістом популярної культури.
    </p>
    <p>
      Релігійні та культурні упередження у багатьох публікаціях значно зменшуються. У порівнянні з
      більшістю веборієнтованих ресурсів, відкритий підхід Вікіпедії разюче збільшує шанси, що певні
      неточності чи невірні твердження доволі швидко будуть скориговані.
    </p>
    <p>
      Не існує центрального пункту, де могла б бути здійснена цензура, тому цензура, що
      впроваджувалась би якоюсь групою, обмежилась би до «офіційних повідомлень» джерел, або
      «проштовхування» якоїсь окремішньої думки чи то офіційно, чи неофіційно, що є важкодосяжним і
      майже завжди зазнає поразки протягом певного часу.
    </p>
    <p>
      На противагу низці вебресурсів, інформація, що додається, не втрачається, не «зникає», ніколи
      не «губиться» чи знищується.
    </p>
    <HeadlinesSml text="Головні слабкості" />
    <div className="em-link also">
      <i>Вікіпедія:Чому Вікіпедія не така велика</i>
    </div>
    <p>
      Радикальна відкритість Вікіпедії призводить до того, що всяка стаття у всякий момент є в
      ненайкращому стані: чи то в процесі певної кількості редагувань, чи контроверсійних
      переписувань, чи нещодавніх звандалізувань. Вікіпедія має повний редакційний процес прийняття
      рішень, що дає час на дискусії та глибинні рішення, але також допускає непогодження, що можуть
      тривати не один місяць, перш ніж незадовільна якість чи упередження в редагуваннях будуть
      подолані.
    </p>
    <p>
      Оскільки неприкритий вандалізм легко визначається і швидко виправляється, Вікіпедія підпадає
      під більш витончений вандалізм, який може подаватись як типова робота з посиланнями. Не існує
      універсального методу, котрий би убезпечив навіть статті, які повинні бути у всіх вікіпедіях
      від проблем, які описані вище, тому Вікіпедія може містити безпідставні твердження та помилки.
    </p>
    <p>
      Статті можуть бути незакінченими, що легко долалося б, якби були щільні взаємопосилання та
      точні інтервікі, натомість деякі аспекти можуть бути добре висвітлені, решта ж можуть бути
      зовсім короткі або ж зовсім не розкриті. Чимало дописувачів цілковито не притримуються
      ключових політик і можуть додавати інформацію без вказання джерел.
    </p>
    <HeadlinesSml text="Якість інформації" />
    <div className="em-link">
      <i>Вікіпедія:Надійність Вікіпедії та Вікіпедія:Дослідження з Вікіпедією</i>
    </div>
    <p>
      Оскільки статті Вікіпедії загалом досягають хороших стандартів після редагувань, важливо
      зазначити, що нові чи слабоконтрольовані статті можуть піддаватись вандалізмові та додаванню
      дезінформації, і це, звичайно, сприяє значним проблемам із зрілістю статей.
    </p>
    <p>
      Невідповідні редагування більшості статей визначаються і коригуються за відносно невеликий
      час. Дослідження показали, що Вікіпедія є майже таким же достовірним джерелом як Енциклопедія
      Британіка, із співмірною кількістю помилок, зі схожими великими чи малими неточностями,
      погрішностями тощо (для українського читача таким порівнянням могла б бути Енциклопедія
      українознавства). Достовірність (надійність, авторитетність, респектабельність) Вікіпедії
      підтверджується тим, що поступово збільшуються академічні посилання на Вікіпедію і цитування
      її як джерела, що вона стає відправним пунктом у дослідженнях, її статті загалом перевіряються
      на здоровий глузд. Статті та інші елементи Вікіпедії інколи містять помилки, але помилки,
      вандалізм та дезінформація коригуються достатньо швидко.
    </p>
    <div className="em-link-also">
      <i>Вікіпедія:Авторитетні джерела</i>
    </div>
    <HeadlinesSml text="Відповіді на критику Вікіпедії" />
    <div className="em-link">
      <i>Вікіпедія:Відповіді на критику</i>
    </div>
    <HeadlinesSml text="Відмова від відповідальності" />
    <div className="em-link">
      <i>Вікіпедія:Відмова від відповідальності</i>
    </div>
  </div>
);
