import React from 'react';
import './styles.scss';
import { Headlines } from '../../../components/Headlines';

export const Introduction = () => (
  <div className="introduction">
    <Headlines text="Вступ" />
    <div className="introduction-content">
      <p>
        Запрошуємо до Вікіпедії (назва утворена із слів вікі та енциклопедія), вільної енциклопедії,
        яку кожен може редагувати. Останні три слова є фактично девізом (слоганом) Вікіпедії і їх
        можна бачити у лівому верхньому кутку Головної сторінки.
      </p>
      <p>
        Із часу створення у 2001, Вікіпедія швидко зросла в один із найбільших осідків (сайтів) в
        Інтернеті. Вміст Вікіпедії вільний, пишеться спільно людьми з усього світу. Осідок
        ґрунтується на технології вікі — це означає, що кожен, хто має інтернет-з'єднання, може
        редагувати, коригувати, вдосконалювати інформацію по всій енциклопедії (за невеликим
        винятком, таким як захищені статті або ж головна сторінка), просто клацаючи на посилання
        редагувати, яке є зверху кожної статті Вікіпедії. Натиснувши посилання (закладку) редагувати
        зверху або «редагувати», можна редагувати цю статтю.
      </p>
      <p>
        На Вікіпедії та її дочірніх проєктах редагуйте статті, пишайтесь своїм внеском, додавайте
        знання, які вважаєте потрібними (можливими) і які сприятимуть співпраці. Вперед!
      </p>
      <p>
        У кожній статті посилання (лінки) вестимуть вас до пов'язаних статей, часто з додатковою
        інформацією. Додавайте подальшу інформацію, перехресні посилання, цитати настільки,
        наскільки це дозволено стандартами та політикою Вікіпедії. Не бійтеся випадково нашкодити
        Вікіпедії, коли ви додаєте або покращуєте інформацію, позаяк вікіпедисти завжди поруч, щоб
        порадити чи скоригувати очевидні помилки, коли це потрібно. Та й програмне забезпечення
        Вікіпедії, відоме як MediaWiki, старанно спроєктоване так, щоби було якнайлегше скасувати
        помилки редагування.
      </p>
      <p>
        Оскільки Вікіпедія є перспективним проєктом, в якому кожен може брати участь, вона вагомою
        мірою відрізняється від паперових джерел. Зокрема, старіші статті мають тенденцію бути
        охопнішими та збалансованішими, у той самий час можуть і містити вагому дезінформацію,
        неенциклопедичний вміст чи вандалізм. Користувачу варто бути обізнаним, як отримати
        адекватну інформацію, уникаючи, тим самим, дезінформації, що була недавно додана й ще не
        вилучена (див. Довідка:Пошук). Однак, при цьому, на відміну від паперової енциклопедії,
        Вікіпедія є цілковито сучасною (up-to-date), що означає, що основні зміни, зміни щодо
        найгучніших подій, можуть створюватись протягом хвилин, годин, на відміну від місяців чи
        років, як у друкованих енциклопедіях.
      </p>
      <p>
        Вікіпедія є також інтернет-спільнотою і соціальною мережею в Інтернеті. Без праці спільноти
        Вікіпедія не мала б теперішнього вигляду і наповнення.
      </p>
      <p>
        Якщо ви ще не читали, зверніть увагу на те, чим Вікіпедія є (і чим не є) та докладнішим
        пошуком. Тож, якщо ви знаєте, як цим користатися, маєте можливість робити внесок до
        Вікіпедії так довго, як того хочете. Подальшу інформацію з найголовніших питань знайдете
        нижче.
      </p>
      <p>Насолоджуйтесь перегортанням сторінок!</p>
    </div>
  </div>
);
