import React from 'react';
import { NavLinkButton } from '../../ui/NavLinkButton';

export const StageThree = ({ stageStep, updateStep }) => {
  const onHandleUpdate = () => {
    updateStep(stageStep + 1);
  };
  return (
    <div className="stage-three">
      <br />
      <b>Значущість</b>
      <br />
      <p>
        Умовам включення до Вікіпедії відповідає дуже мала кількість компаній і організацій. У світі
        мільйони компаній, але менш 0,1 % з них достатньо значущі для Вікіпедії.
      </p>
      <br />
      <p>
        Для Вікіпедії компанія має відповідати загальному критерію значущості. За загальним
        критерієм значущості, предмети здогадно є значущі, якщо вони достатньо докладно освітлюються
        в незалежних авторитетних джерелах, на кшталт газет, часописів, наукових статей, книг і т.
        д. Докладніше див. Вікіпедія:Критерії значущості. Варто також перевірити компанію на
        відповідність до критеріїв значущості організації.
      </p>
      <br />
      <b>Конфлікт інтересів і реклама</b>
      <br />
      <p>
        Якщо ви тісно пов'язані з компанією, про яку збираєтесь писати, можливий конфлікт інтересів,
        і вам буде важко написати добру, нейтральну і енциклопедичну статтю. Вам буде важко написати
        статтю не в рекламному стилі — а реклама заборонена правилами. Через це, якщо ваш внесок
        схожий на рекламу або не відповідає критеріям значущості, скоріш за все він буде швидко
        видалений. Найкраща порада в цьому випадку — <b>не писати статтю:</b> ви можете залишити
        запит на створення статті. Якщо ваша організація значуща, рано чи пізно хто-небудь про неї
        напише. Тим часом ви можете написати іншу статтю — наприклад, про галузь, в яку входить ваша
        компанія.
      </p>
      <hr />
      <h1>Ваша організація відповідає вимогам?</h1>
      <NavLinkButton
        onClick={onHandleUpdate}
        text=">> Моя стаття — не реклама та описує значущу компанію"
      />
      <NavLinkButton
        onClick={onHandleUpdate}
        text=">> Мою статтю можуть визнати рекламою (допоможіть!)"
      />
      <NavLinkButton
        onClick={onHandleUpdate}
        text=">> Моя стаття про організацію, яка може бути незначною (що мені робити?)"
      />
    </div>
  );
};
