import React from 'react';
import './styles.scss';

export const Result = () => (
  <div className="layaout-item">
    <div className="result">
      <h1>Підсумок</h1>
      <div className="result-center-container">
        <ul>
          <li>
            Різні типи сторінок розташовані в різних просторах назв. Простір назв конкретної
            сторінки можна визначити за префіксом, розташованим перед двокрапкою в назві сторінки.
          </li>
          <li>
            Більшість сторінок мають також пов'язані з ними сторінки обговорень для різних дискусій,
            пов'язаних із вмістом основної сторінки.
          </li>
          <li>Пошук можна робити, користуючись полем вгорі справа екрана.</li>
          <li>
            Перенаправлення направляють Вас з однієї сторінки на іншу. Скорочення є службовими
            сторінками для полегшення роботи редакторів і працюють як перенаправлення.
          </li>
        </ul>
        <img
          src="https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Clipboard.svg/240px-Clipboard.svg.png"
          alt="/"
        />
      </div>
      <h1>Більше інформації</h1>
      <ul>
        <li>Довідка:Обговорення статей</li>
        <li>Довідка:Пошук</li>
        <li>Довідка:Простір назв</li>
      </ul>
    </div>
  </div>
);
