import React from 'react';
import { entrBtn } from '../entrBtn';
import './styles.scss';

export const Redirection = () => (
  <div className="layaout-item">
    <div className="redirection">
      <div className="rediraction-top-content">
        <h1>Перенаправлення</h1>
        <div className="top-text">
          <p>
            Деякі сторінки у Вікіпедії є перенаправленнями — вони не мають власного контенту, і лише
            перенаправляють Вас на якусь іншу сторінку. Наприклад, США — це перенаправлення на
            статтю Сполучені Штати Америки. Тож якщо Ви введете в полі пошуку США і клацнете кнопку
            {entrBtn()}, то потрапите безпосередньо на сторінку статті про Сполучені Штати Америки
            (під назвою статті також буде маленька примітка: «Перенаправлено з США»).
          </p>
          <img
            src="https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Go-jump.svg/200px-Go-jump.svg.png"
            alt="/"
          />
        </div>
      </div>
      Для того, щоб перенаправити якусь сторінку, можна або скористатися меню{' '}
      <span className="burger-img">
        <img
          src="https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/OOjs_UI_icon_menu.svg/40px-OOjs_UI_icon_menu.svg.png"
          alt="/"
        />
      </span>{' '}
      у Візуальному редакторі й клацнути OOjs UI icon pageSettings.svg Налаштування сторінки, щоб
      вибрати цільову сторінку, або вставити такий код вікірозмітки: #ПЕРЕНАПРАВЛЕННЯ [[Назва
      цільової сторінки]] (у редакторі вікірозмітки на панелі редагувань, під вкладкою «Додатково»,
      також є кнопка OOjs UI icon articleRedirect-ltr.svg, яка вставляє відповідний код на
      сторінку). Однак варто мати на увазі, що перенаправлення з одного простору назв на інший є
      небажаними.
      <h1>Скорочення</h1>
      <p>
        Вікіпедисти часто посилаються на внутрішні сторінки Вікіпедії за допомогою спеціальних
        скорочень, щоб пришвидшити введення тексту. Префікс простору назв «Вікіпедія:» теж можна
        скорочувати до ВП:. Такі сторінки зі скороченнями є простими перенаправленнями на цільові
        сторінки.
      </p>
      <p>
        Наприклад, посилання на сторінку Вікіпедія:Нейтральна точка зору можна записати як ВП:НТЗ,
        або вписати це скорочення в поле пошуку, щоб перейти на відповідну сторінку. Якщо сторінка
        має якісь скорочення, вони зазвичай виписані в окремому блоці вгорі справа такої сторінки.
      </p>
    </div>
  </div>
);
