import './styles.scss';
import { HeadlinesSml } from '../../../../../components/HeadlinesSml';

export const FlippingAbout = () => (
  <div className="about-flipping">
    <div className="make-better-flipping">
      <HeadlinesSml text="Гортання Вікіпедії" />
      <div className="em-link">
        <i>Вікіпедія:Гортання</i>
      </div>
      <div className="flipping-content">
        <p>
          Чимало відвідувачів прийшли сюди, щоб набути знань або ж щоб поділитися ними з іншими.
          Дійсно, це надзвичайно захоплююче — вдосконалювати сотні статей. Ви маєте можливість
          переглядати зміни на сторінці останніх редагувань. Нові статті також реєструються. Чимало
          людей звідусіль допомагають у написанні статей до Вікіпедії.
        </p>
        <p>
          Вікіпедія має також чимало перспективних проєктів. Метою і сподіванням тих, хто розвиває
          Вікіпедію, є забезпечення корисною та достовірною інформацією інших. Проєкти допомагають
          скоординувати зусилля. Чимало статей починаються як обманки, але після багатьох редагувань
          вони стають вибраними статтями.
        </p>
        <p>
          Якщо ви не можете знайти того, що шукаєте, зазирніть, де задати запитання, або ж знайдіть
          список розділів, де добровольці нададуть вам відповіді на будь-які запитання, що можуть
          трапитися.
        </p>
        <p>
          Може статись, що у Вікіпедії немає статті з питання, яке вас цікавить. Ви можете дати
          запит на її написання (або ж маєте змогу дослідити питання й самому висвітлити його).
        </p>
        <p>У вас є також можливість переглядати випадкову статтю.</p>
        <p>
          Для вашої зручності є статті, написані в Вікіпедії іншими мовами. Вікіпедія має понад дві
          сотні різних мов (див. повний список і статистику; інші мовні версії), включно спрощену
          англійську, латинську, есперанто та споріднені (їх ще називають братні, сестринські,
          дочірні тощо) проєкти (словник, цитатник, книжки, підручники, джерела цитувань для
          науковців та сервери новин; посилання на споріднені проєкти подано в наступному розділі).
          Всі вони підтримуються, поновляються та керуються поокремці спільнотами й часто включають
          інформацію, що спонукає до роздумів, й статті, які важко віднайти іншими звичними шляхами.
        </p>
      </div>
    </div>
  </div>
);
