import { NavLinkButton } from '../../ui/NavLinkButton';
import './styles.scss';
import './adaptive.scss';

export const FifthStage = ({ stageStep, updateStep }) => {
  const onHandleUpdate = () => {
    updateStep(stageStep + 1);
  };
  return (
    <div className="fifth-stage">
      <div className="fifth-stage-content">
        <div className="content-container">
          <div className="container-top-content">
            <div className="top-content-left-part">
              <b>Ваша стаття не повинна порушувати авторських прав.</b>
              <br />
              <p>
                <b>Не копіюйте і не вставляйте текст з інших сайтів</b>, якщо це не правильно
                оформлена цитата[3]. Статті, що порушують авторські права, будуть обов'язково
                видалені в найкоротші терміни[1]. Пишіть статті самі і власними словами[2]. Якщо ваш
                текст має деякі вади — це нормально — згодом його можна виправити. Пам'ятати про
                авторські права треба і при завантажені зображень[4].
              </p>
              <br />
            </div>
            <div className="top-content-right-part">
              <div className="copyright-alert">
                <div className="alert-header">
                  <h1>Авторські права</h1>
                </div>
                <div className="alert-text">
                  <img
                    src="https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Circle-style-warning.svg/110px-Circle-style-warning.svg.png"
                    alt="/"
                  />
                  Не копіюйте текст з інших сайтів! Допускається дослівне цитування лише коротких
                  уривків, оформлених як правильна цитата[1][2][3].
                </div>
              </div>
            </div>
          </div>
          <b>Значущість повинна бути показана.</b>
          <br />В попередньому кроці розповідалось про те, яким критеріям має відповідати об'єкт,
          щоб вважатися значущим. Переконайтесь, що читач, прочитавши вашу статтю, зрозуміє, чому
          об'єкт значущий.
          <br />
          <b>Ваша стаття повинна бути нейтральною.</b>
          <p>
            Статті Вікіпедії повинні відображати нейтральну точку зору. Хоча критика або схвалення
            по відношенню до суб'єкта статті повністю допустима, ваша стаття має підходити до
            об'єкта з нейтрального боку. Пишіть лише про факти — краще включити вже оприлюднені
            раніше сторонні думки про об'єкт, ніж писати власні. Стаття має описувати всі значущі
            погляди справедливо і пропорційно. Статті, які повністю критикують або вихваляють
            об'єкт, можуть бути видалені, або повністю переписані іншими.
          </p>
          <hr />
          <h1>Ваша стаття повністю відповідає вимогам?</h1>
          <NavLinkButton
            onClick={onHandleUpdate}
            text=">> Моя стаття нейтральна, показує значущість і не скопійована зі сторонніх сайтів"
          />
          <NavLinkButton
            onClick={onHandleUpdate}
            text=">> Моя стаття не відповідає вимогам (допоможіть!)"
          />
        </div>
      </div>
    </div>
  );
};
