import React from 'react';
import { NavLink } from 'react-router-dom';
import { entrBtn } from '../entrBtn';
import './styles.scss';

export const PageSearch = () => (
  <div className="layaout-item">
    <div className="top-text">
      <p>
        Поле пошуку розташоване справа вгорі екрану. Клацніть на нього і почніть вводити бажаний
        текст, і воно одразу видаватиме пропозиції сторінок, які Ви, можливо, шукаєте — можете
        клацнути на одну з таких пропозицій, щоб перейти одразу на відповідну сторінку. Так само й
        якщо Ви введете повну назву сторінки й натиснете {entrBtn()}, то потрапите одразу ж на
        потрібну сторінку.
      </p>
      <img
        src="https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/System-search.svg/240px-System-search.svg.png"
        alt="/"
      />
    </div>
    <p>
      Якщо ж Ви введете слово чи фразу, для якої немає відповідної статті (або вона називається
      якось інакше), то після натискання клавіші {entrBtn()}потрапите на спеціалізовану{' '}
      <NavLink to="https://uk.wikipedia.org/wiki/%D0%A1%D0%BF%D0%B5%D1%86%D1%96%D0%B0%D0%BB%D1%8C%D0%BD%D0%B0:%D0%9F%D0%BE%D1%88%D1%83%D0%BA">
        сторінку пошуку
      </NavLink>
      , на якій буде показано статті, в яких трапляється Ваш пошуковий термін. На ту сторінку також
      можна потрапити, ввівши щось у пошукове поле і клацнувши «що містять...» внизу списку
      пропозицій. Наприклад, цією функцією можна скористатись, якщо Ви хочете знайти випадки
      використання слова «інфлятон» у статтях Вікіпедії, замість того, щоб потрапити на сторінку
      статті з назвою
      <NavLink to="https://uk.wikipedia.org/wiki/%D0%86%D0%BD%D1%84%D0%BB%D1%8F%D1%82%D0%BE%D0%BD">
        «Інфлятон»
      </NavLink>
      .
    </p>
    <img
      className="pages-search-img"
      src="https://upload.wikimedia.org/wikipedia/commons/4/4e/%D0%86%D0%BD%D1%82%D0%B5%D1%80%D1%84%D0%B5%D0%B9%D1%81_%D1%81%D1%82%D0%BE%D1%80%D1%96%D0%BD%D0%BA%D0%B8_%D0%BF%D0%BE%D1%88%D1%83%D0%BA%D1%83.png"
      alt="/"
    />
    <p>
      Сторінка пошуку також дає змогу шукати в межах різних просторів назв. Ви можете вибрати опцію
      для пошуку (за замовчуванням — лише основний простір статей, можна вибрати також пошук серед
      обговорень або в просторі довідки) або клацнути «Додати простори назв», щоб вибрати якісь інші
      простори назв для пошуку в них, а також можна скористатись Розширеними параметрами, щоб
      застосувати особливі параметри пошуку.
    </p>
  </div>
);
